; domain
(define (domain blocks)
  (:requirements :strips :typing :equality
                 :universal-preconditions
                 :conditional-effects)
  (:types physob)
  (:predicates   
      (ontable ?x - physob)
      (clear ?x - physob) 
      (on ?x ?y - physob))
  
  (:action move
    :parameters (?x ?y - physob)
    :precondition (and (clear ?x) (clear ?y) (not (= ?x ?y)))
    :effect (and 
              (forall (?z - physob)
                (when (on ?x ?z)
                  (and (clear ?z) (not (on ?x ?z)))))
              (on ?x ?y)
              (not (clear ?y))
              (not (ontable ?x))))
             
  (:action moveToTable
    :parameters (?x - physob)
    :precondition (and (not (ontable ?x)) (clear ?x))
    :effect (and 
              (forall (?y - physob)
                (when (on ?x ?y)
                  (and (clear ?y) (not (on ?x ?y)))))
              (ontable ?x)))
)

; problem
(define (problem prob)
 (:domain blocks)
 (:objects A B C D E F - physob)
 (:init (clear A)(on A B)(on B C)(ontable C) (ontable D)
  (ontable F)(on E D)(clear E)(clear F)
)
 (:goal  (and (clear F) (on F A) (on A C) (ontable C)(clear E) (on E B)
         (on B D) (ontable D)) )
 )

; plan
1. (movetotable a)
   deleted: (on a b)
   added: (clear b) (ontable a)
   goals met: 4 of 8
2. (move f a)
   deleted: (clear a) (ontable f)
   added: (on f a)
   goals met: 5 of 8
3. (movetotable e)
   deleted: (on e d)
   added: (clear d) (ontable e)
   goals met: 5 of 8
4. (move b d)
   deleted: (on b c) (clear d)
   added: (clear c) (on b d)
   goals met: 6 of 8
5. (move e b)
   deleted: (clear b) (ontable e)
   added: (on e b)
   goals met: 7 of 8
6. (movetotable f)
   deleted: (on f a)
   added: (clear a) (ontable f)
   goals met: 6 of 8
7. (move a c)
   deleted: (clear c) (ontable a)
   added: (on a c)
   goals met: 7 of 8
8. (move f a)
   deleted: (clear a) (ontable f)
   added: (on f a)
   goals met: 8 of 8
